#include "Draw.h"
#include <iostream>

#include <algorithm>
#include <intrin.h>
#include <vector>
#include <string>
using namespace std;


#define j_junk() UsefulFuntion(25415, 75242, 2451, 7897);
inline int UsefulFuntion(int x, int y, int z, int r)
{
    for (int i = 2; i < 8; i++)
    {
        z += 456;
        r -= 55;
        x++;
        y--;

    }
    for (int i = 0; i < 2; i++)
    {
        x++;
        y += 234;
        z -= 23;
        r += 634;
    }
    return x + z + r + y;
}

bool SHOW = true;

LPDIRECT3D9 d3d;    // the pointer to our Direct3D interface
LPDIRECT3DDEVICE9 d3ddev;
int Width = GetSystemMetrics(SM_CXSCREEN);
int Height = GetSystemMetrics(SM_CYSCREEN);
RECT GameRect = { NULL };
HWND GameWnd = NULL;
float ScreenCenterX;
float ScreenCenterY;
HWND MyWnd = NULL;
const MARGINS Margin = { -1 ,-1, -1, -1 };
MSG Message = { NULL };

#define M_PI                       3.14159265358979323846f
#define M_PI_F		((float)(M_PI))	// Shouldn't collide with anything.

struct FVector
{
    float                                              X;                                                        // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData)
    float                                              Y;                                                        // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData)
    float                                              Z;                                                        // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData)

    inline FVector()
        : X(0), Y(0), Z(0) {
    }

    inline FVector(float x, float y, float z) : X(x), Y(y), Z(z) {}

    __forceinline FVector operator-(const FVector& V) {
        return FVector(X - V.X, Y - V.Y, Z - V.Z);
    }

    __forceinline FVector operator+(const FVector& V) {
        return FVector(X + V.X, Y + V.Y, Z + V.Z);
    }

    __forceinline FVector operator*(float Scale) const {
        return FVector(X * Scale, Y * Scale, Z * Scale);
    }

    __forceinline FVector operator/(float Scale) const {
        const float RScale = 1.f / Scale;
        return FVector(X * RScale, Y * RScale, Z * RScale);
    }

    __forceinline FVector operator+(float A) const {
        return FVector(X + A, Y + A, Z + A);
    }

    __forceinline FVector operator-(float A) const {
        return FVector(X - A, Y - A, Z - A);
    }

    __forceinline FVector operator*(const FVector& V) const {
        return FVector(X * V.X, Y * V.Y, Z * V.Z);
    }

    __forceinline FVector operator/(const FVector& V) const {
        return FVector(X / V.X, Y / V.Y, Z / V.Z);
    }

    __forceinline float operator|(const FVector& V) const {
        return X * V.X + Y * V.Y + Z * V.Z;
    }

    __forceinline float operator^(const FVector& V) const {
        return X * V.Y - Y * V.X - Z * V.Z;
    }

    __forceinline FVector& operator+=(const FVector& v) {
        X += v.X;
        Y += v.Y;
        Z += v.Z;
        return *this;
    }

    __forceinline FVector& operator-=(const FVector& v) {
        X -= v.X;
        Y -= v.Y;
        Z -= v.Z;
        return *this;
    }

    __forceinline FVector& operator*=(const FVector& v) {
        X *= v.X;
        Y *= v.Y;
        Z *= v.Z;
        return *this;
    }

    __forceinline FVector& operator/=(const FVector& v) {
        X /= v.X;
        Y /= v.Y;
        Z /= v.Z;
        return *this;
    }

    __forceinline bool operator==(const FVector& src) const {
        return (src.X == X) && (src.Y == Y) && (src.Z == Z);
    }

    __forceinline bool operator!=(const FVector& src) const {
        return (src.X != X) || (src.Y != Y) || (src.Z != Z);
    }

    __forceinline float Size() const {
        return sqrt(X * X + Y * Y + Z * Z);
    }

    __forceinline float Distance(const FVector& v)
    {

        return float(sqrtf(powf(v.X - X, 2.0) + powf(v.Y - Y, 2.0) + powf(v.Z - Z, 2.0)));
    }

    __forceinline float Size2D() const {
        return sqrt(X * X + Y * Y);
    }

    __forceinline float SizeSquared() const {
        return X * X + Y * Y + Z * Z;
    }

    __forceinline float SizeSquared2D() const {
        return X * X + Y * Y;
    }

    __forceinline float Dot(const FVector& vOther) const {
        const FVector& a = *this;
        return (a.X * vOther.X + a.Y * vOther.Y + a.Z * vOther.Z);
    }

    __forceinline FVector Normalize() {
        FVector vector;
        float length = this->Size();

        if (length != 0) {
            vector.X = X / length;
            vector.Y = Y / length;
            vector.Z = Z / length;
        }
        else
            vector.X = vector.Y = 0.0f;
        vector.Z = 1.0f;

        return vector;
    }

    __forceinline FVector ToRotator() {
        FVector rotator;
        rotator.X = -(float)atan(Z / Size2D()) * (float)(180.0f / M_PI);
        rotator.Y = (float)atan(Y / X) * (float)(180.0f / M_PI);
        rotator.Z = (float)0.f;
        if (X >= 0.f)
            rotator.Y += 180.0f;
        return rotator;
    }

    __forceinline FVector Clamp()
    {
        FVector clamped;
        while (clamped.Y < -180.0f)
            clamped.Y += 360.0f;
        while (clamped.Y > 180.0f)
            clamped.Y -= 360.0f;

        if (clamped.X < -74.0f)
            clamped.X = -74.0f;
        if (clamped.X > 74.0f)
            clamped.X = 74.0f;
        return clamped;
    }
};

struct color {
    int a, r, g, b;
    color() = default;

    color(const int r, const int g, const int b, const int a = 255) : _color{ } {
        this->r = r;
        this->g = g;
        this->b = b;
        this->a = a;
    }

    explicit color(const uint32_t color) : _color{ } {
        this->a = color >> 24 & 0xff;
        this->r = color >> 16 & 0xff;
        this->g = color >> 8 & 0xff;
        this->b = color & 0xff;
    }

    static color from_uint(const uint32_t uint) {
        return color(uint);
    }

    unsigned char& operator[ ](const int index) {
        return _color[index];
    }

    template <typename T>
    color hsv_to_rgb(T h, T s, T v, const float alpha) const {
        int _r, _g, _b;

        if (s != 0) {

            h == 360 ? h = 0 : h = h / 60;
            auto i = static_cast<int>(trunc(h));
            int f = h - i;

            const int p = v * (1 - s);
            const int q = v * (1 - s * f);
            const int t = v * (1 - s * (1 - f));

            switch (i) {
            case 0:
                _r = v;
                _g = t;
                _b = p;
                break;

            case 1:
                _r = q;
                _g = v;
                _b = p;
                break;

            case 2:
                _r = p;
                _g = v;
                _b = t;
                break;

            case 3:
                _r = p;
                _g = q;
                _b = v;
                break;

            case 4:
                _r = t;
                _g = p;
                _b = v;
                break;

            default:
                _r = v;
                _g = p;
                _b = q;
                break;
            }
        }
        else {
            _r = v;
            _g = v;
            _b = v;
        }

        return color(static_cast<uint8_t>(_r * 255), static_cast<uint8_t>(_g * 255),
            static_cast<uint8_t>(_b * 255), alpha);
    }

    unsigned char _color[4];
};

void DrawBorder(int x, int y, int w, int h, int px, D3DCOLOR BorderColor, IDirect3DDevice9* pDevice)
{

    DrawBox(x, (y + h - px), w, px, BorderColor, pDevice);
    DrawBox(x, y, px, h, BorderColor, pDevice);
    DrawBox(x, y, w, px, BorderColor, pDevice);
    DrawBox((x + w - px), y, px, h, BorderColor, pDevice);

}

void DrawESPBox(FVector Head, FVector Foot, DWORD dwColor, int rectAlpha, LPDIRECT3DDEVICE9 pDevice)
{
    FVector Box = Head - Foot;

    if (Box.Y < 0)
        Box.Y *= -1;

    int BoxWidth = (int)Box.Y / 2;
    int BoxHeight = (int)Box.Y / 2;
    int DrawX = (int)Head.X - (BoxWidth / 2);
    int DrawY = (int)Head.Y;

    DrawBorder(DrawX, DrawY, BoxWidth, (int)Box.Y, 1, dwColor, pDevice);
}

template <typename T>
T read(uintptr_t address)
{
    T buffer{ };
    ReadProcessMemory(GetCurrentProcess(), (LPVOID)address, &buffer, sizeof(T), 0);
    return buffer;
}

template<typename T>
bool write(uintptr_t address, T* buffer, SIZE_T sizeh)
{
    if (address > 0x7FFFFFFFFFFF || address < 1) return 0;
    WriteProcessMemory(GetCurrentProcess(), (LPVOID)address, buffer, sizeh, 0);
}

__forceinline __int64 decrypt_uworld(const uint32_t key, const uintptr_t* state)
{
    unsigned __int64 v19; // r11
    unsigned __int64 v20; // r8
    unsigned __int64 v21; // r9
    unsigned int v22; // er10
    unsigned __int64 v23; // rcx
    unsigned __int64 v24; // rdx
    unsigned __int64 v25; // rcx
    int v26; // ebx
    unsigned int v27; // ecx
    __int64 v28; // rax
    unsigned __int64 v29; // r8
    unsigned __int64 v30; // r8
    unsigned __int64 v31; // rcx
    unsigned __int64 v32; // rdx
    unsigned __int64 v33; // rcx

    v19 = 2685821657736338717i64 * ((unsigned int)key ^ (unsigned int)(key << 25) ^ (((unsigned int)key ^ ((unsigned __int64)(unsigned int)key >> 15)) >> 12)) % 7 % 7;
    v20 = state[v19];
    v21 = (2685821657736338717i64 * ((unsigned int)key ^ (unsigned int)(key << 25) ^ (((unsigned int)key ^ ((unsigned __int64)(unsigned int)key >> 15)) >> 12))) >> 32;
    v22 = (unsigned int)v19;
    if (!v19)
    {
        v23 = (2 * (v20 - (unsigned int)(v21 - 1))) ^ ((2 * (v20 - (unsigned int)(v21 - 1))) ^ ((v20 - (unsigned int)(v21 - 1)) >> 1)) & 0x5555555555555555i64;
        v24 = (4 * v23) ^ ((4 * v23) ^ (v23 >> 2)) & 0x3333333333333333i64;
        v25 = (16 * v24) ^ ((16 * v24) ^ (v24 >> 4)) & 0xF0F0F0F0F0F0F0Fi64;
        v20 = rol8((v25 << 8) ^ ((v25 << 8) ^ (v25 >> 8)) & 0xFF00FF00FF00FFi64, 32);
    LABEL_26:
        v26 = 2 * v19;
        goto LABEL_27;
    }
    if (v22 != 1)
        goto LABEL_26;
    v26 = 2 * v19;
    v20 = rol8(v20 - (unsigned int)(2 * v19 + v21), (unsigned __int8)(((int)v21 + (int)v19) % 0x3Fu) + 1);
LABEL_27:
    v27 = v26 + v21;
    if (v22 == 2)
        v20 = ~(v20 - v27);
    switch (v22)
    {
    case 3u:
        v28 = 2 * ((2 * v20) ^ ((2 * v20) ^ (v20 >> 1)) & 0x5555555555555555i64);
        v20 = v28 ^ (v28 ^ (((2 * v20) ^ ((2 * v20) ^ (v20 >> 1)) & 0x5555555555555555i64) >> 1)) & 0x5555555555555555i64;
        break;
    case 4u:
        v29 = ror8(v20, (unsigned __int8)(v27 % 0x3F) + 1);
        v20 = (2 * v29) ^ ((2 * v29) ^ (v29 >> 1)) & 0x5555555555555555i64;
        break;
    case 5u:
        v30 = ror8(v20, (unsigned __int8)(v27 % 0x3F) + 1);
        v31 = (2 * v30) ^ ((2 * v30) ^ (v30 >> 1)) & 0x5555555555555555i64;
        v32 = (4 * v31) ^ ((4 * v31) ^ (v31 >> 2)) & 0x3333333333333333i64;
        v33 = (16 * v32) ^ ((16 * v32) ^ (v32 >> 4)) & 0xF0F0F0F0F0F0F0Fi64;
        v20 = rol8((v33 << 8) ^ ((v33 << 8) ^ (v33 >> 8)) & 0xFF00FF00FF00FFi64, 32);
        break;
    case 6u:
        v20 = ~v20 - (unsigned int)(v21 + v19);
        break;
    }
    return v20 ^ (unsigned int)key;
}

uint64_t valBase = (uintptr_t)GetModuleHandleA(0);

uint64_t UWorld = 0;

uint64_t ReadWorld()
{
    uint64_t key = read<uint64_t>(valBase + 0x75CF2B8);
#pragma pack(push, 1)
    struct State
    {
        uint64_t Keys[7];
    };
#pragma pack(pop)
    const auto state = read<State>(valBase + 0x75CF280);

    return read<uint64_t>(decrypt_uworld(key, (uint64_t*)&state));
}

struct alignas(16) FQuat
{
    float                                              X;                                                        // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData)
    float                                              Y;                                                        // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData)
    float                                              Z;                                                        // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData)
    float                                              W;                                                        // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData)
};

struct alignas(16) FPlane : public FVector
{
    float                                              W;                                                        // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData)
};

struct FMatrix
{
    struct FPlane                                      XPlane;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible, SaveGame, IsPlainOldData)
    struct FPlane                                      YPlane;                                                   // 0x0010(0x0010) (Edit, BlueprintVisible, SaveGame, IsPlainOldData)
    struct FPlane                                      ZPlane;                                                   // 0x0020(0x0010) (Edit, BlueprintVisible, SaveGame, IsPlainOldData)
    struct FPlane                                      WPlane;                                                   // 0x0030(0x0010) (Edit, BlueprintVisible, SaveGame, IsPlainOldData)

    FMatrix operator*(const FMatrix& pM2)
    {
        FMatrix pOut;
        pOut.XPlane.X = XPlane.X * pM2.XPlane.X + XPlane.Y * pM2.YPlane.X + XPlane.Z * pM2.ZPlane.X + XPlane.W * pM2.WPlane.X;
        pOut.XPlane.Y = XPlane.X * pM2.XPlane.Y + XPlane.Y * pM2.YPlane.Y + XPlane.Z * pM2.ZPlane.Y + XPlane.W * pM2.WPlane.Y;
        pOut.XPlane.Z = XPlane.X * pM2.XPlane.Z + XPlane.Y * pM2.YPlane.Z + XPlane.Z * pM2.ZPlane.Z + XPlane.W * pM2.WPlane.Z;
        pOut.XPlane.W = XPlane.X * pM2.XPlane.W + XPlane.Y * pM2.YPlane.W + XPlane.Z * pM2.ZPlane.W + XPlane.W * pM2.WPlane.W;
        pOut.YPlane.X = YPlane.X * pM2.XPlane.X + YPlane.Y * pM2.YPlane.X + YPlane.Z * pM2.ZPlane.X + YPlane.W * pM2.WPlane.X;
        pOut.YPlane.Y = YPlane.X * pM2.XPlane.Y + YPlane.Y * pM2.YPlane.Y + YPlane.Z * pM2.ZPlane.Y + YPlane.W * pM2.WPlane.Y;
        pOut.YPlane.Z = YPlane.X * pM2.XPlane.Z + YPlane.Y * pM2.YPlane.Z + YPlane.Z * pM2.ZPlane.Z + YPlane.W * pM2.WPlane.Z;
        pOut.YPlane.W = YPlane.X * pM2.XPlane.W + YPlane.Y * pM2.YPlane.W + YPlane.Z * pM2.ZPlane.W + YPlane.W * pM2.WPlane.W;
        pOut.ZPlane.X = ZPlane.X * pM2.XPlane.X + ZPlane.Y * pM2.YPlane.X + ZPlane.Z * pM2.ZPlane.X + ZPlane.W * pM2.WPlane.X;
        pOut.ZPlane.Y = ZPlane.X * pM2.XPlane.Y + ZPlane.Y * pM2.YPlane.Y + ZPlane.Z * pM2.ZPlane.Y + ZPlane.W * pM2.WPlane.Y;
        pOut.ZPlane.Z = ZPlane.X * pM2.XPlane.Z + ZPlane.Y * pM2.YPlane.Z + ZPlane.Z * pM2.ZPlane.Z + ZPlane.W * pM2.WPlane.Z;
        pOut.ZPlane.W = ZPlane.X * pM2.XPlane.W + ZPlane.Y * pM2.YPlane.W + ZPlane.Z * pM2.ZPlane.W + ZPlane.W * pM2.WPlane.W;
        pOut.WPlane.X = WPlane.X * pM2.XPlane.X + WPlane.Y * pM2.YPlane.X + WPlane.Z * pM2.ZPlane.X + WPlane.W * pM2.WPlane.X;
        pOut.WPlane.Y = WPlane.X * pM2.XPlane.Y + WPlane.Y * pM2.YPlane.Y + WPlane.Z * pM2.ZPlane.Y + WPlane.W * pM2.WPlane.Y;
        pOut.WPlane.Z = WPlane.X * pM2.XPlane.Z + WPlane.Y * pM2.YPlane.Z + WPlane.Z * pM2.ZPlane.Z + WPlane.W * pM2.WPlane.Z;
        pOut.WPlane.W = WPlane.X * pM2.XPlane.W + WPlane.Y * pM2.YPlane.W + WPlane.Z * pM2.ZPlane.W + WPlane.W * pM2.WPlane.W;
        return pOut;
    }
};

struct alignas(16) FTransform
{
    struct FQuat                                       Rotation;                                                 // 0x0000(0x0010) (Edit, BlueprintVisible, SaveGame, IsPlainOldData)
    struct FVector                                     Translation;                                              // 0x0010(0x000C) (Edit, BlueprintVisible, SaveGame, IsPlainOldData)
    unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
    struct FVector                                     Scale3D;                                                  // 0x0020(0x000C) (Edit, BlueprintVisible, SaveGame, IsPlainOldData)
    unsigned char                                      UnknownData01[0x4];                                       // 0x002C(0x0004) MISSED OFFSET

    FMatrix ToMatrixWithScale()
    {
        FMatrix m;
        m.WPlane.X = Translation.X;
        m.WPlane.Y = Translation.Y;
        m.WPlane.Z = Translation.Z;

        float x2 = Rotation.X + Rotation.X;
        float y2 = Rotation.Y + Rotation.Y;
        float z2 = Rotation.Z + Rotation.Z;

        float xx2 = Rotation.X * x2;
        float yy2 = Rotation.Y * y2;
        float zz2 = Rotation.Z * z2;
        m.XPlane.X = (1.0f - (yy2 + zz2)) * Scale3D.X;
        m.YPlane.Y = (1.0f - (xx2 + zz2)) * Scale3D.Y;
        m.ZPlane.Z = (1.0f - (xx2 + yy2)) * Scale3D.Z;

        float yz2 = Rotation.Y * z2;
        float wx2 = Rotation.W * x2;
        m.ZPlane.Y = (yz2 - wx2) * Scale3D.Z;
        m.YPlane.Z = (yz2 + wx2) * Scale3D.Y;

        float xy2 = Rotation.X * y2;
        float wz2 = Rotation.W * z2;
        m.YPlane.X = (xy2 - wz2) * Scale3D.Y;
        m.XPlane.Y = (xy2 + wz2) * Scale3D.X;

        float xz2 = Rotation.X * z2;
        float wy2 = Rotation.W * y2;
        m.ZPlane.X = (xz2 + wy2) * Scale3D.Z;
        m.XPlane.Z = (xz2 - wy2) * Scale3D.X;

        m.XPlane.W = 0.0f;
        m.YPlane.W = 0.0f;
        m.ZPlane.W = 0.0f;
        m.WPlane.W = 1.0f;

        return m;
    }
};

class CameraStruct
{
public:
    FVector Position; //0x11B0 
    FVector Rotation; //0x11BC 
    float Fov; //0x11C8 
}; //Size=0x11CC

namespace Offsets
{
    uintptr_t oLevel = 0x38;
    uintptr_t oGameInstance = 0x1A8;
    uintptr_t oLocalPlayers = 0x40;
    uintptr_t oPlayerController = 0x38;
    uintptr_t oLocalPawn = 0x440;
    uintptr_t RootComp = 0x210;
    uintptr_t oCameraManager = 0x458;
    uintptr_t oCameraCache = 0x1220;
    uintptr_t ObjID = 0x18;

    uintptr_t Dormant = 0xD8;
    uintptr_t RelativeLocation = 0x15C;
    uintptr_t RelativeRotation = 0x168;
    uintptr_t PlayerState = 0x3C8;
    uintptr_t Ping = 0x3B8;

    uintptr_t TeamComponent = 0x598;
    uintptr_t Team = 0xF8;
    uintptr_t DamageHandler = 0x968;
    uintptr_t Health = 0x188;
    uintptr_t HealthMax = 0x198;

    uintptr_t Mesh = 0x408;
    uintptr_t StaticMesh = 0x518;
    uintptr_t StaticMesh_Cached = 0x528;

    uintptr_t ComponentToWorld = 0x250;
    uintptr_t UniqueID = 0x38;

    uintptr_t ControlRotation = 0x418;

    uintptr_t PlayerName = 0x3A8;
};

uint64_t PlayerController = 0;

